{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "file": "",
    "link": "https://www.oszk.hu/",
    "text": ""
  },
  "text": {
    "more": "Széchényi Ferenc levélben tájékoztatta a korabeli tudós nemesség tagjait egy Nemzeti Könyvtár alapításáról. A könyvtáralapítás által kívánta megmenteni és továbbhagyományozni a haza szellemi örökségét s egyben bizonyítani azt is, hogy a magyarság állandó, szerves része az európai nemzetek szellemi közösségének. Leveléhez a könyvtári katalógus saját költségén nyomtatott első köteteit is csatolta. A címzettek jegyzékét Széchényi instrukciói alapján Miller Jakab Ferdinánd, a könyvtár első őre és Tibolth Mihály, a gróf titkára és levéltárosa állította össze. Széchényi Ferenc tudatosan gyűjtötte össze és őrizte meg a neves kortársaktól érkező válaszleveleket. A válaszlevelek válogatásából 2012-ben nyomtatott kiadvány készült („Levélben értesítsen engem” c. album) Deák Eszter és Zvara Edina szerkesztésében. A kiadvány közel száz magyar nyelvű, illetve magyar fordításban közreadott, addig túlnyomórészt kiadatlan kortársi levelet tartalmaz. Az OSZK Digitális Bölcsészeti Központban pedig előkészületben van a levelezés teljes szövegkorpuszának digitális szövegkiadása. Az albumban egy közel hétszáz tételes táblázat foglalja össze mindazon személyeket és intézményeket, akiket Széchényi Ferenc a katalógus köteteivel megajándékozott. Ez az adatkorpusz képezi az itt látható vizualizáció alapját. A táblázat tartalmazza a címzett személyek rövid életrajzi adatait, hogy megkapta és válaszolt-e a levélre, a válaszlevél nyelvét és lelőhelyét. Egyes címzettek esetében az adatokat portréval, részletesebb életrajzzal és a levélhez csatolt mellékletek fotójával bővítettük.  Az ábra origója Széchényi Ferenc, aki egy személyben fogja össze a teljes értelmiségi közeget. Az interaktív adatvizualizáció célkitűzése megmutatni gróf Széchényi Ferenc kiterjedt kapcsolati hálóját, valamint a címzettek változatosságát és a levelek nyelvi sokféleségét. Ezek az adatok már önmagukban is azt szemléltetik, hogy a könyvtáralapítás gondolatához komoly előkészületek, tervek és tudatos kommunikációs tevékenység társult.               Ferenc Széchényi informed the members of the nobility and intellectuals about the foundation of a National Library through a letter. The purpose of founding the library was to preserve and endow the intellectual heritage of his homeland and, at the same time, demonstrate that Hungary is a permanent and integral part of the educated community of European nations. He also enclosed with his letter the first volumes of the library catalogue, printed at his own expense. Based on Széchényi's instructions, the list of recipients was compiled by Jakab Ferdinand Miller, the first custodian of the library, and Mihály Tibolth, the Count's secretary and archivist. Széchényi deliberately collected and preserved the replies from his prominent contemporaries. A selection of the letters was published in 2012: Levélben értesítsen engem [Inform me by letter] edited by Eszter Deák and Edina Zvara. The publication contains nearly a hundred contemporary letters published in Hungarian or Hungarian translation. (Most of them were published for the first time). The Digital Humanities Centre of the Library is now preparing a digital edition of the complete corpus of the correspondence. The album is the bases of the visualisation, for it contains nearly seven hundred names, including every person and institution to whom Ferenc Széchényi has sent the volumes of the catalogue. We build a database including biographical details of the addressee, whether they received and replied to the letter, the language and the institution that holds the reply letter today. In case of some recipients, we included a portrait, a more detailed biography and a photo of the letter attachments. Ferenc Széchényi is at the centre of the graph: he is the person who connects the entire noble and erudite community, and the correspondents are around him. The objective of this interactive data visualisation is to show the extensive network of Ferenc Széchényi, as well as the diversity of correspondents and the linguistic diversity of the letters.",
    "intro": "Az Országos Széchényi Könyvtár alapítása 220. évfordulójának alkalmából jött létre az Esszencia c. kiállítás. A tárlat részeként készült el Széchényi Ferenc kapcsolatainak vizualizációja, melynek alapját mintegy hétszáz korabeli autográf levélváltás képezi, amely ma is megtalálható az OSZK Kézirattárában.",
    "title": "Széchényi levelezése"
  },
  "legend": {
    "edgeLabel": "Nyelv",
    "colorLabel": "Címzett típusa",
    "nodeLabel": "Címzett",
    "colorLabel1": "Személy",
    "colorLabel2": "Város",
    "colorLabel3": "Vármegye",
    "colorLabel4": "Horvát vármegye",
    "colorLabel5": "Horvát-szlavón város",
    "colorLabel6": "Káptalan, egyházi testület",
    "colorLabel7": "Széchényi"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": "címzett típusa",
    "hoverBehavior": "dim"
  },
  "informationPanel": {
    "groupByEdgeDirection": false,
    "imageAttribute": false
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "curve",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
      "activeFontStyle": "bold",
      "defaultLabelColor": "#fff",
      "labelThreshold": 9,
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "bold",
      "defaultLabelSize": 14
    },
    "graphProperties": {
      "maxEdgeSize": 2.0,
      "minEdgeSize": 0.7,
      "minNodeSize": 1,
      "maxNodeSize": 7
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}